
a = input("Сколько продуктов вы купили? ")
b = input("Какая цена за штуку? ")
m = input("Какой товар? банан, яблоко или груша: ")



a = int(a)
b = int(b)
e = int(a * b)
if a < 5:
    print("Ваша скидка 0%")
    print("Цена за все: " + str(e) + "$")

elif m == "банан" and m == "яблоко":
    print("Скидка больше 5% на бананы и яблоки не действует")
    print("Ваша скидка 0%")
    print("Цена за все: " + str(e) + "$")

elif a >= 5 and a < 10:
    c = 3
    print("Цена за все: " + str(e) + "$")
    print("Ваша скидка: " + str(c) + "%")
    d = e * c / 100
    print("Цена вашей скидки: " + str(d) + "$")
    print("Ваша общая цена с учетом скидки: " + str(e - d) + "$")

elif a >= 10 and e > 100:
    j = 6.5
    print("Цена за все: " + str(e) + "$")
    print("Ваша скидка: " + str(j) + "%")
    g = e * j / 100
    print("Цена вашей скидки: " + str(g) + "$")
    print("Ваша общая цена с учетом скидки: " + str(e - g) + "$")


elif a >= 10 or e > 100 or m == "банан" and m == "яблоко":

    f = 5
    print("Цена за все: " + str(e) + "$")
    print("Ваша скидка: " + str(f) + "%")
    g = e * f / 100
    print("Цена вашей скидки: " + str(g) + "$")
    print("Ваша общая цена с учетом скидки: " + str(e - g) + "$")










